package _for_01;

public class mission_01 {

	public static void main(String[] args) {
		// TODO Auto-gednerated method stub
		// 다음 실행 결과를 손코딩으로 예측해 보세요
//		1.
//		for(int i=0; i<5; i++){
//			sysout(i);
//		}
		
//		<주석>
//		for(초기값,조건,증감식)으로 구성되며, 실행 순서는 초기값 --> 조건 -->코드블록 --> 증감식 이다.
//		for문은 조건이 참일때 까지 반복한다, 조건이 false면 반복문을 빠져나간다.
//		초기값: 반복할 변수의 초기값을 설정한다.
//		조건식: 조건식에 참과 거짓을 구분해, 반복 진행 여부를 결정하는 곳이다.
//		증감식: 반복 횟수를 결정하는 곳이다. 변수에 값을 더하거나, 빼거나, 곱하는 등 수형 방식을 실정한다.
		
		
//		<문제분석>
//		초기값: 0
//		조건식: i가 5보다 작을때까지.
//		증감식: 코드블록 실행 후 i를 1씩 증가.
		
//		<결과>
//		i=0
//		i=1
//		i=2
//		i=3
//		i=4
		
		
		
		
	}

}
