package _for_01;

public class mission_03 {

	public static void main(String[] args) {
//		3. 
//		for(int i=0; i<100; i++){
//			if(i%2==0){
//				sysout(i)
//			}
//		}
		
//		<문제분석>
//		초기값: 0
//		조건식: i가 100보다 작을때까지 반복.
//		증감식: 코드블록 실행 후, i를 1씩 증가한다.
		
//		문제속 반복문에 대한 분석
//		반복 조건: i가 짝수이면 반복문 내 코드불록이 실행된다.
		
//		반복문은 조건식이 참일때만 코드블록이 실행된다.
//		조건문도 조건이 참일때만 코드블록이 실행된다.
		
//		이 문제에서는 반복문에 조건, 조건문에 조건 모두가 참일 경우 sysout(i); 코드가 실행될 수 있다.
//		따라서 이 문제에 담은 0~99까지 숫자증 모든 짝수를 출력하는 것이다. 
		
		
		
		
	}

}
